{
  "Recipes": [
    {
      "id": 1,
      "name": "Spinach Soup with Roasted Tofu",
      "votes": 4,
      "imageUrl": "https://cdn.eat-vegan.rocks/2015/11/Spinatsuppe-mit-gebratenem-Tofu-Spinach-Soup-with-Roasted-Tofu-380x285.jpg",
      "serving": 4,
      "ingredients": [
        "200 g \tsmoked tofu",
        "1 tsp \tred curry paste",
        "1 Tbsp \tcoconut oil",
        "500 g \tleaf spinach (frozen)",
        "250 g \tmushrooms",
        "2 l \tvegetable broth",
        "2 twigs \tparsley",
        "2 Tbsp \tcoconut oil",
        "1 Tbsp \tflour",
        "1 tsp \tblack peppercorns",
        "1 tsp \tcurcuma salt"
      ],
      "steps": [
        "Cut smoked tofu into small pieces",
        "Heat coconut oil in the pan, roast tofu with curry paste briefly and then remove",
        "Chop thawed spinach and parsley separated, clean mushrooms and halve or quarter them",
        "Sauté spinach in a pan with some coconut oil for ~5 minutes, stirring occasionally and finally remove",
        "Melt coconut oil in a pot and add flour all at once whisking vigorously. Stir occasionally until the roux gets light brownish",
        "Deglaze roux with vegetable broth and add all ingredients, simmer for 5 minutes"
      ],
      "cooktime": 30,
      "description": "The spinach soup with roasted tofu is naturally gluten-free and is suitable as a main meal, as well as an appetizer.",
      "isFavourite": true
    },
    {
      "id": 2,
      "name": "Grated Kohlrabi Salad with Beetroot, Carrot, Cucumber and Sprouts",
      "votes": 5,
      "serving": 2,
      "imageUrl": "https://cdn.eat-vegan.rocks/2015/11/Geriebener-Kohlrabi-Salat-mit-Rote-Bete-Karotte-Gurke-und-Sprossen-Grated-Kohlrabi-Salad-with-Beetroot-Carrot-Cucumber-and-Sprouts-380x285.jpg",
      "ingredients": [
        "150 g \tsoy yogurt (natural)",
        "0.5 tsp \toregano",
        "0.5 tsp \trosemary",
        "½ tsp \tsalt",
        "1 tsp \tpepper",
        "1 tsp \tdill",
        "1 Tbsp \tcanola oil",
        "1 Tbsp \tagave syrup",
        "100 g \tkohlrabi",
        "100 g \tbeetroots",
        "150 g \tcarrots",
        "150 g \tcucumber",
        "1 \tshallot",
        "25 g \tred radish sprouts",
        "30 g \talfalfa sprouts"
      ],
      "steps": [
        "Mix well soy yogurt together with all the herbs, salt, rapeseed oil and agave syrup",
        "Peel and chop the shallot",
        "Peel kohlrabi, carrots and beetroot and grater coarsely all together with the cucumber (alternatively: chop coarsely and blend briefly)",
        "Mix everything well and serve with the sprouts"
      ],
      "cooktime": 20,
      "description": "Grated Kohlrabi Salad with Beetroot, Carrot, Cucumber and Sprouts",
      "isFavourite": true
    },
    {
      "id": 3,
      "name": "Salmone Affogato in Olio d Oliva",
      "votes": 5,
      "serving": 2,
      "imageUrl": "https://www.vzug.com/medias/sys_master/recipeimages/recipeimages/hca/h2a/9450104651806/recipe-img-slide.jpg",
      "ingredients": [
        "2 Salmon Fillets",
        "Olive Oil",
        "3 garlic cloves",
        "a few thyme stems",
        "1or 2 rosemary sprigs",
        "a small bundle of sage leaves",
        "salt and pepper",
        "lemon"
      ],
      "steps": [
        "Leave salmon out for 1 hour to get to room temperature, wash and dry salmon salt and pepper set aside. In a small pot large enough to fit your pieces of fish, pour in olive oil, enough to just cover the fish. Add in a sachet made with cheese cloth of thyme, rosemary, sage and garlic cloves unpeeled and flattened with the back of a knife. If you don't have cheese cloth put herbs and garlic right in oil. Heat up to 180 degrees add fish and set timer for 12 minutes. Remove and serve with lemon slices or wedges, salt and pepper and a drizzle of olive oil."
      ],
      "cooktime": 30,
      "description": "The salmon was poached in olive oil along with a sachet of fresh picked herbs and garlic. This process highlighted the richness of the fish. Serve with rice or roasted potatoes and a vegetable and or",
      "isFavourite": true
    },
    {
      "id": 4,
      "name": "Cheesecake with Blueberries",
      "votes": 2,
      "serving": 3,
      "imageUrl": "https://funcook.com/upload_pic_r/thumbnail_1605021717-650x385.jpg",
      "ingredients": [
        "250 Grams Cookies",
        "6 Grams of Gelatin sheets",
        "175 Grams of Condensed milk",
        "100 Grams of Butter",
        "325 Grams of Blueberry jam",
        "225 Grams of Cream with 35 % fat",
        "250 Grams of Spread cheese"
      ],
      "steps": [
        "To make the cookie base, crush the cookies to a powder.",
        "Melt the butter.",
        "Mix the crushed cookies with the butter.",
        "Spread the mixture on the bottom of a round mold lined with parchment paper, press with your hands so that the cookie base is firm and consistent and store in the fridge.",
        "Hydrate the gelatin sheets in cold water.",
        "Semi mount 175 ml. cream.",
        "Mix the cheese spread with the condensed milk.",
        "Heat the 50 ml. remaining cream, add the drained gelatin sheets, stir until they have completely dissolved, add to the cheese and condensed milk mixture and mix until obtaining a homogeneous cream.",
        "Add the semi-whipped cream, mix until completely integrated, pour the cream cheese over the biscuit base, cover with plastic wrap and store in the refrigerator until it has completely solidified.",
        "Cover the cake with the blueberry jam and carefully unmold."
      ],
      "cooktime": 20,
      "description": "it is highly recommended to line the mold with baking paper so that it does not stick and thus avoid any unpleasant surprises",
      "isFavourite": true
    },
    {
      "id": 5,
      "name": "Stir-Fried Broccoli with Chili and Sichuan Pepper (Qiang Xi Nan Hua Cai)",
      "votes": 5,
      "serving": 2,
      "imageUrl": "https://wgbh.brightspotcdn.com/dims4/default/aeb449f/2147483647/strip/true/crop/5568x3037+0+337/resize/990x540!/format/jpg/quality/70/?url=https%3A%2F%2Fwgbh.brightspotcdn.com%2F47%2F1b%2F13f4d65441eaa2fb28d9056cf3ff%2F02.09.18CPK-810.jpg",
      "ingredients": [
        "11 oz (300g) broccoli",
        "5-6 dried chilis, to taste salt",
        "4 tbsp cooking oil",
        "1/2 tsp whole Sichuan peppercorns",
        "1 tsp sesame oil"
      ],
      "steps": [
        "Cut broccoli into florets, and cut large florets lengthwise into smaller pieces.  Peel the stalk and slice thickly.  Snip the chilis into halves or sections and discard the seeds as much as possible. Bring a generous 2 1/2 quarts of water to a boil, add 1 tsp salt and 1 tbsp oil.  Add broccoli and blanch for 2-3 minutes.  Broccoli should be bright and crisp.  Drain in a colander. Add remaining oil with the chilies and Sichuan peppercorns to a seasoned wok over high heat.  Stir-fry briefly until the chilis are just beginning to brown (take care not to burn them).  Add the broccoli and stir-fry for 30 seconds or so until the florets are coated in the fragrant oil, seasoning with salt to taste.  Turn off the heat, stir in the sesame oil, and serve."
      ],
      "cooktime": 60,
      "description": "Stir-Fried Broccoli with Chili and Sichuan Pepper (Qiang Xi Nan Hua Cai)",
      "isFavourite": false
    }
  ]
}